uat_chat/AccumulationRegisters/уатСписаниеАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатСписаниеАгрегатов</Name>
			<Comment>Списание агрегатов (уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПричиныСписанияАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатПланРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатПланРаботыТС</Name>
			<Comment>План работы ТС</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДетализацияПланирования</Name>
					<Comment>Детализация планирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Comment>Документ планирования</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПланированиеРаботыТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Comment>Параметр выработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Заказ на ТС</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Comment>Маршрут</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБилета</Name>
					<Comment>Вид билета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыБилетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/CommonModules/уатПроведение_проф/Ext/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ДВИЖЕНИЙ РЕГИСТРОВ

// Выполняет движения регистра сведений Местонахождение ТС
//
Процедура ОтразитьМестонахождениеТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаМестонахожденияТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаМестонахожденияТС;
	
	Если Отказ ИЛИ ТаблицаМестонахожденияТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатМестонахождениеТС;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаМестонахожденияТС);

КонецПроцедуры

// Выполняет движения регистра сведений Прейскуранты ТС
//
Процедура ОтразитьПрейскурантыТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПрейскурантыТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПрейскурантыТС;
	
	Если Отказ ИЛИ ТаблицаПрейскурантыТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатПрейскурантыТС;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаПрейскурантыТС);

КонецПроцедуры

// Выполняет движения регистра сведений Тарифы ЗП сотрудников
//
Процедура ОтразитьТарифыЗП(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаТарифыЗП = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТарифыЗП;
	
	Если Отказ ИЛИ ТаблицаТарифыЗП.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатТарифыСотрудников;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаТарифыЗП);

КонецПроцедуры

// Выполняет движения регистра накопления Движение денежных сресдств
//
Процедура ОтразитьДвижениеДДС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДвижениеДС;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатДвижениеДС;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Выработка сотрудников
//
Процедура ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВзаиморасчетов;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатВзаиморасчетыСКонтрагентами;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Выработка сотрудников
//
Процедура ОтразитьПричиныСписанияАгрегатов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ПричиныСписанияАгрегатов;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатСписаниеАгрегатов;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Заявки на расходование ДС
//
Процедура ОтразитьЗаявкиНаРасходованиеДС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаявокНаРасходованиеДС;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатЗаявкиНаРасходованиеДС;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Заявки на расходование ДС
//
Процедура ОтразитьКонтролируемыеЗначенияБюджетов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКонтролируемыхЗначенияБюджетов;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатКонтролируемыеЗначенияБюджетов;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра сведений границы периодов бюджетирования
//
Процедура ОтразитьГраницыПериодовБюджетирования(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаГраницПериодов;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатГраницыПериодовБюджетирования;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра сведений зависимости оборотов по статьям бюджетирования
//
Процедура ОтразитьЗависимостиОборотовПоСтатьямБюджетирования(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗависимостейОборотов;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатЗависимостиОборотовПоСтатьямБюджетирования;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра сведений План работы ТС
//
Процедура ОтразитьПланРаботыТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПланаРаботыТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПланаРаботыТС;
	
	Если Отказ ИЛИ ТаблицаПланаРаботыТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОборотыПоЗаправкамГСМ = Движения.уатПланРаботыТС;
	ДвиженияОборотыПоЗаправкамГСМ.Записывать = Истина;
	ДвиженияОборотыПоЗаправкамГСМ.Загрузить(ТаблицаПланаРаботыТС);

КонецПроцедуры

// Выполняет движения регистра сведений зависимости оборотов по затратам по видам перевозок
//
Процедура ОтразитьЗатратыПоВидамПеревозок(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыПоВидамПеревозок;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатЗатратыПоВидамПеревозок;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры
